#----------------------------------------------------------------------------------
# Exploration du fichier des prénoms (Insee)
#-----------------------------------------------------------------------------------

In [2]:
import pandas as pd
import numpy as np

# 1. Import les données dans un DataFrame en utilisant l'UnboundLocalError

url = "https://www.insee.fr/fr/statistiques/fichier/2540004/nat2021_csv.zip"
df_prenoms = pd.read_csv(url, sep=";")

In [3]:
df_prenoms.head()

   sexe        preusuel annais  nombre
0     1  _PRENOMS_RARES   1900    1249
1     1  _PRENOMS_RARES   1901    1342
2     1  _PRENOMS_RARES   1902    1330
3     1  _PRENOMS_RARES   1903    1286
4     1  _PRENOMS_RARES   1904    1430

In [4]:
df_prenoms.tail()

        sexe preusuel annais  nombre
686533     2    ZYNEB   2018       5
686534     2    ZYNEB   2019       7
686535     2    ZYNEB   2020       8
686536     2    ZYNEB   2021       6
686537     2    ZYNEB   XXXX      19

In [5]:
df_prenoms.sample()

        sexe preusuel annais  nombre
495531     2   LAÏSSA   2011       3

In [6]:
df_prenoms.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 686538 entries, 0 to 686537
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   sexe      686538 non-null  int64
 1   preusuel  686536 non-null  object
 2   annais    686538 non-null  object
 3   nombre    686538 non-null  int64
dtypes: int64(2), object(2)
memory usage: 21.0+ MB

## Partie 2 : Nettoyage des données

In [11]:
# Val manquantes dans la col des prénoms

df_prenoms[df_prenoms["preusuel"].isnull()]

        sexe preusuel annais  nombre
579411     2      NaN   2003       3
579412     2      NaN   XXXX      29

In [14]:
# Proportion des id avec _prenoms rare

prop_rares = df_prenoms.groupby('preusuel')["nombre"].sum()["_PRENOMS_RARES"] / df_prenoms["nombre"].sum()
prop_rares

np.float64(0.01965912697163539)

In [17]:
df_prenoms = df_prenoms.replace("_PRENOMS_RARES", np.nan)
df_prenoms

        sexe preusuel annais  nombre
0          1      NaN   1900    1249
1          1      NaN   1901    1342
2          1      NaN   1902    1330
3          1      NaN   1903    1286
4          1      NaN   1904    1430
...      ...      ...    ...     ...
686533     2    ZYNEB   2018       5
686534     2    ZYNEB   2019       7
686535     2    ZYNEB   2020       8
686536     2    ZYNEB   2021       6
686537     2    ZYNEB   XXXX      19

[686538 rows x 4 columns]